app/Models/CategoriaModel.php

    public function mostrar()
    {
        $categoriaConsulta = $this->where('estado', 1)->findAll();
---
SELECT *
FROM `categoria`
WHERE `estado` = 1

    public function mostrarEliminados()
    {
        //select *from categoria where estado = 0;
        $resultado = $this->where('estado', '0')->findAll();;
---
SELECT *
FROM `categoria`
WHERE `estado` = '0'

    public function restaurar($id)
    {
        //true o false, (update, save) //pensar validaciones
        $resultado = $this->update($id, ['estado' => '1']);
---
UPDATE `categoria` SET `estado` = '1', `fecha_edit` = '2023-07-10 16:28:28'
WHERE `categoria`.`id` IN ('1')