app/Models/RecepcionistaModel.php

SELECT *
FROM `recepcionista`
WHERE `estado` = 1
---
    public function mostrar()
    {
        $recepcionistaConsulta = $this->where('estado', 1)->findAll();