app/Models/RolModel.php

        public function mostrar() {
            return $this->where('estado', 1)->findAll();
---
SELECT *
FROM `rol`
WHERE `estado` = 1