app/Models/UsuarioModel.php

    public function mostrarId($id_usuario)
    {
        return $this->where('id_usuario', $id_usuario)->first();
---
SELECT *
FROM `usuario`
WHERE `id_usuario` = '4'
 LIMIT 1